let employee : [Number, String, Number, Number, Number, String][]
employee = [
    [1001,"ศุภกิตติ์",7,30000,0,""],
    [1002,"ก้องภพ",5,25000,0,""],
    [1003,"ธเนศ",2,10000,0,""],
    [1004,"วศก",6,28000,0,""],
    [1005,"โรโบคอป",4,22000,0,""],
]
employee.forEach((s)=>{
    s[4] = s[3]*s[4];
    if(s[2]<=1){
        s[4] = 1    //เงินเดือน*1 ไม่ได้โบนัส
    }else if(s[2]<=3){
        s[4] = 2    //เงินเดือน*2 โบนัส 1 เท่าของเงินเดือน
        s[5] = "Rice Cooker"
    }else if(s[2]<=5){
        s[4] = 3    //เงินเดือน*3 โบนัส 2 เท่าของเงินเดือน
    }else{
        s[4] = 4 //เงินเดือน*4 โบนัส 3 เท่า
        s[5] = "Microwave Oven"
    }
    console.log(`
    ====================
    ID: ${s[0]}  
    name:${s[1]}
    workYear:${s[2]}
    salary:${s[3]}
    bonus:${s[4]}
    gift:${s[5]}
    =====================
    `)
});
